## Reshaping with Hierarchical Indexing

In [2]:
import numpy as np
import pandas as pd

In [4]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                 index=pd.Index(['Ohio', 'Colorado'], name='state'),
                 columns=pd.Index(['one', 'two', 'three'], name='number'))

In [5]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [20]:
df_stack = data.stack()
df_stack

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [21]:
df_stack.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [22]:
df_stack.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [23]:
df_stack.unstack('number')

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [24]:
df_stack.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

## Pivoting

In [44]:
data = pd.DataFrame(np.arange(18).reshape((6, 3)),
                 index=pd.Index(['one', 'two', 'three', 'four', 'five', 'six'], name='state'),
                 columns=pd.Index(['india', 'china', 'russia'], name='number'))

In [45]:
data

number  india  china  russia
state
one         0      1       2
two         3      4       5
three       6      7       8
four        9     10      11
five       12     13      14
six        15     16      17

In [46]:
df_pivoted = data.pivot('india','china')

In [47]:
df_pivoted

number russia
china      1    4    7     10    13    16
india
0         2.0  NaN  NaN   NaN   NaN   NaN
3         NaN  5.0  NaN   NaN   NaN   NaN
6         NaN  NaN  8.0   NaN   NaN   NaN
9         NaN  NaN  NaN  11.0   NaN   NaN
12        NaN  NaN  NaN   NaN  14.0   NaN
15        NaN  NaN  NaN   NaN   NaN  17.0

In [48]:
df_pivoted = data.pivot('india','china','russia')

In [49]:
df_pivoted

china   1    4    7     10    13    16
india
0      2.0  NaN  NaN   NaN   NaN   NaN
3      NaN  5.0  NaN   NaN   NaN   NaN
6      NaN  NaN  8.0   NaN   NaN   NaN
9      NaN  NaN  NaN  11.0   NaN   NaN
12     NaN  NaN  NaN   NaN  14.0   NaN
15     NaN  NaN  NaN   NaN   NaN  17.0